//循环打印1-10之间所有的整数
// for(var i = 1; i <= 10; i++){
//     console.log(i);
// }

//打印1-100之间所有能被3整除的数

// for (var i = 1; i<=100; i++){
//     if (i%3 ===0){
//         console.log(i);
//     }
// }

//打印1-100之间所有能被7整除的数值的和

// for ( var i = 1,sum = 0; i <=100; i++){
//     if(i%7 ===0){
//         console.log(i);
//         sum +=i;
//     }
// }
// console.log('累计和为',sum);
//多个循环条件，后面会覆盖前面的
// for ( var i = 1, j = 10; i <= 20, j >= 10; i++,j--){
//     console.log(i,j);
// }

//练习：计算一些运算的结果
//1/30 + 3/28 + 5/26 + 7/24 + 9/22 + 11/20 + 13/18;

for (var i =1, j = 30; i <=13; i += 2, j -=2){
    
}