// var i = 1;
// //do...while
// //循环打印1-10之间所有的整数

// do {
//     //循环体
//     console.log(i);
//     i++;
// }while(i<=10);

//练习：使用循环打印1-100之间所有的奇数

// var i = 1;
// do {
//     //循环体
//     if (i%2 === 1){
//         console.log(i);
//     }
//     i++;
// }while(i <=100);

//练习：使用循环打印1-100之间所有的奇数的和

// var i = 1;
// var sum = 0;
// do {
//     if(i%2 === 1){
//         sum += i;
//     }
//     i++;
// }while(i<=100);

// console.log(sum);

//练习：加入有一张厚度0.0001米的纸，折叠多少次后能到达到珠穆朗玛峰的高度(8848);
//没对折一次，相当于*2；
var a = 0.0001;
var i = 1;
do (
    a *= 2;
    i++;
)